 module.exports.config = {
    name: 'autosend',
    version: '10.02',
    hasPermssion: 2,
    credits: 'DC-Nam', // được fix bởi sơn pro
    description: 'Tự động gửi tin nhắn theo giờ sẽđã cài!',
    commandCategory: 'Hệ thống',
    usages: '[]',
    cooldowns: 3
};
const r = a => a[Math.floor(Math.random()*a.length)],
{
    get
} = require('axios'),
config = [{
        timer: '12:30:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
          {
        timer: '12:00:00 AM',
    message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '11:30:00 AM',
    message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '10:30:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '9:30:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '8:30:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '7:30:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '6:30:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
          {
    timer: '6:00:00 AM',
    message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '5:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{ 
        timer: '12:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{ 
        timer: '12:00:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '11:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '10:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '9:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '8:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '8:00:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '7:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '6:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '5:45:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '5:00:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '4:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '3:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '2:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{ 
        timer: '2:00:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '1:30:00 PM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '11:00:00 AM',
    message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '10:00:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '9:00:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '8:00:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
},
{
        timer: '7:00:00 AM',
        message: ['🔔𝐓𝐮̛̣ 𝐝𝐨̣̂𝐧𝐠 𝐭𝐡𝐨̂𝐧𝐠 𝐛𝐚́𝐨 𝐭𝐡𝐞𝐨 𝐠𝐢𝐨̛̀🔔\n⏰ 𝐁𝐚̂𝐲 𝐠𝐢𝐨̛̀ 𝐥𝐚̀: {time}\n🎶 𝐂𝐡𝐮́𝐜 𝐜𝐚́𝐜 𝐛𝐚̣𝐧 𝐧𝐠𝐡𝐞 𝐧𝐡𝐚̣𝐜  𝐯𝐮𝐢 𝐯𝐞̉❤️']
      }];
module.exports.onLoad = o => {
    if (!!global.autosendmessage_setinterval) clearInterval(global.autosendmessage_setinterval);
    global.autosendmessage_setinterval = setInterval(async function() {
        if (á = config.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) {
            var msg = r(á.message);
            msg = msg.replace(/{time}/g, (require("moment-timezone")).tz("Asia/Ho_Chi_Minh").format("HH:mm:ss (D/MM/YYYY) (dddd)")).replace(/{thinh}/g, (await get(`http://botblackcute.tk/api/hearing.php`)).data.data)
            msg = {
                body: msg, attachment: (await get((await get(`https://docs-api.blackbotloapi.repl.co/video/music`)).data.data, {
                    responseType: 'stream'
                })).data
            };
            global.data.allThreadID.forEach(i => o.api.sendMessage(msg, i));
        };
    }, 1000);
};
module.exports.run = () => {};